# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a
# километров. Каждый день спортсмен увеличивал результат на 10% относительно
# предыдущего. Требуется определить номер дня, на который результат спортсмена составит не
# менее b километров. Программа должна принимать значения параметров a и b и выводить
# одно натуральное число — номер дня.

a = int(input('Введите результат первого дня в км: '))
b = int(input('Введите общий желаемый результат в км: '))

days = 1
km = a

while km < b:
    a = a + 0.1 * a
    days += 1
    km = km * a
print(f'Вы достигнете желаемых результатов на {days} день')